#+TITLE: January 21, 2019 - February 5, 2019 (16 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 16
  :SPRINTSTART: <2019-01-21 Mon>
  :wpd-bhavin192: 0.5
  :wpd-jasonbraganza: 5
  :wpd-sandeepk: 1.5
  :wpd-vaibhavk: 1.5
  :END:
** bhavin192
*** Learning Golang
**** DONE Chapter 11. Testing [6/6]
     CLOSED: [2019-01-30 Wed 22:43]
     :PROPERTIES:
     :ESTIMATED: 2.5
     :ACTUAL:   1.37
     :OWNER:    bhavin192
     :ID:       READ.1547130354
     :TASKID:   READ.1547130354
     :END:
     :LOGBOOK:
     CLOCK: [2019-01-30 Wed 22:38]--[2019-01-30 Wed 22:43] =>  0:05
     CLOCK: [2019-01-30 Wed 22:23]--[2019-01-30 Wed 22:37] =>  0:14
     CLOCK: [2019-01-28 Mon 19:36]--[2019-01-28 Mon 19:48] =>  0:12
     CLOCK: [2019-01-28 Mon 19:23]--[2019-01-28 Mon 19:35] =>  0:12
     CLOCK: [2019-01-26 Sat 19:49]--[2019-01-26 Sat 19:53] =>  0:04
     CLOCK: [2019-01-26 Sat 19:18]--[2019-01-26 Sat 19:32] =>  0:14
     CLOCK: [2019-01-26 Sat 17:43]--[2019-01-26 Sat 17:59] =>  0:16
     CLOCK: [2019-01-24 Thu 22:35]--[2019-01-24 Thu 22:40] =>  0:05
     :END:
     - [X] 11.1 The go test Tool    (10m)
     - [X] 11.2 Test Functions      (1.7h)
     - [X] 11.3 Coverage            (20m)
     - [X] 11.4 Benchmark Functions (20m)
     - [X] 11.5 Profiling           (25m)
     - [X] 11.6 Example Functions   (5m)
**** DONE Chapter 11 Exercises [2/2]
     CLOSED: [2019-01-29 Tue 22:39]
     :PROPERTIES:
     :ESTIMATED: 3.35
     :ACTUAL:   1.85
     :OWNER:    bhavin192
     :ID:       DEV.1547130395
     :TASKID:   DEV.1547130395
     :END:
     :LOGBOOK:
     CLOCK: [2019-01-29 Tue 22:10]--[2019-01-29 Tue 22:39] =>  0:29
     CLOCK: [2019-01-26 Sat 19:41]--[2019-01-26 Sat 19:47] =>  0:06
     CLOCK: [2019-01-26 Sat 17:37]--[2019-01-26 Sat 17:43] =>  0:06
     CLOCK: [2019-01-22 Tue 20:18]--[2019-01-22 Tue 20:39] =>  0:21
     CLOCK: [2019-01-21 Mon 20:51]--[2019-01-21 Mon 21:23] =>  0:32
     CLOCK: [2019-01-21 Mon 20:08]--[2019-01-21 Mon 20:25] =>  0:17
     :END:
     - [X] 11.2 (3h)
     - [X] 11.4 (1.25h)
*** DONE GNU Emacs bug triaging [2/2]
    CLOSED: [2019-02-05 Tue 23:59]
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:   2.42
    :OWNER:    bhavin192
    :ID:       OPS.1545721236
    :TASKID:   OPS.1545721236
    :END:
    :LOGBOOK:
    CLOCK: [2019-02-05 Tue 23:25]--[2019-02-05 Tue 23:59] =>  0:34
    CLOCK: [2019-02-04 Mon 19:35]--[2019-02-04 Mon 19:55] =>  0:20
    CLOCK: [2019-02-02 Sat 11:09]--[2019-02-02 Sat 11:48] =>  0:39
    CLOCK: [2019-01-31 Thu 21:20]--[2019-01-31 Thu 21:39] =>  0:19
    CLOCK: [2019-01-30 Wed 17:12]--[2019-01-30 Wed 17:45] =>  0:33
    :END:
    - [X] Build GNU Emacs 26.1 from source code
    - [X] Triage 5 bugs
      - [X] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=33983][#33983]]: c++-mode syntax highlighting after some symbols
      - [X] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=33979][#33979]]: python.el is not fully PEP 8 compliant for closing parens
      - [X] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=33973][#33973]]: Multi-line C++ raw string literal font lock is broken
      - [X] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=33921][#33921]]: Default height is inconsistently - and apparently
        also incorrectly - documented
      - [X] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=33900][#33900]]: GNUmakefile mode colors fooled by colons in shell commands
** jasonbraganza
*** NIOS Maths Text Book [0/10]
    :PROPERTIES:
    :ESTIMATED: 50.0
    :ACTUAL:
    :OWNER: shaks
    :ID: READ.1548140097
    :TASKID: READ.1548140097
    :END:
    - [ ] Module - I [0/5]
      - [ ] 2019-01-19 - 1 - Sets
      - [ ] 2019-01-20 - 2 - Relations and Functions
      - [ ] 2019-01-21 - 3 - Trigonometric Functions I
      - [ ] 2019-01-22 - 4 - Trigonometric Functions II
      - [ ] 2019-01-25 - 5 - Relation between Sides and Angles of a Triangle
    - [ ] Module - II: Sequences and series [0/2]
      - [ ] 2019-01-26 - 6 - Sequences and series
      - [ ] 2019-01-27 - 7 - Some special sequences
    - [ ] Module - III: Algebra–I [0/5]
      - [ ] 2019-01-28 - 8 - Complex Numbers
      - [ ] 2019-01-29 - 9 - Quadratic Equations and Linear Inequalities
      - [ ] 2019-02-01 - 10 - Principle of Mathematical Induction
      - [ ] 2019-02-02 - 11 -  Permtations and Combinations
      - [ ] 2019-02-03 - 12 - Binomial Theorem
    - [ ] Module - IV: Co-ordinate Geometry [0/4]
      - [ ] 2019-02-09 - 13 - Cartesian System of Rectangular Co-ordinates
      - [ ] 2019-02-10 - 14 - Straight Lines
      - [ ] 2019-02-11 - 15 - Circles
      - [ ] 2019-02-12 - 16 - Conic Sections
    - [ ] Module - V: Statistics and Probability [0/3]
      - [ ] 2019-02-15 - 17 - Measures of Dispersion
      - [ ] 2019-02-16 - 18 - Random Experiments and Events
      - [ ] 2019-02-17 - 19 - Probability
    - [ ] Module - VI: Algebra–II [0/3]
      - [ ] 2019-02-18 - 20 - Matrices
      - [ ] 2019-02-19 - 21 - Determinants
      - [ ] 2019-02-22 - 22 - Inverse of a Matrix and its Applications
    - [ ] Module - VII: Relations and Functions [0/2]
      - [ ] 2019-02-23 - 23 - Relations and Functions II
      - [ ] 2019-02-24 - 24 - Inverse Trigonometric Functions
    - [ ] Module - VIII: Calculus [0/8]
      - [ ] 2019-02-25 - 25 -  Limits and Continuity
      - [ ] 2019-02-26 - 26 - Differentiation
      - [ ] 2019-03-01 - 27 - Differentiation of Trigonometric Functions
      - [ ] 2019-03-02 - 28 - Differentiation of Exponential and Logarithmic functions
      - [ ] 2019-03-03 - 29 - Application of Derivatives
      - [ ] 2019-03-04 - 30 - Integration
      - [ ] 2019-03-05 - 31 - Definite Integrals
      - [ ] 2019-03-08 - 32 - Differential Integrals
    - [ ] Module - IX: Vectors and Three Dimensional Geometry [0/4]
      - [ ] 2019-03-09 - 33 - Introduction to Three Dimensional Geometry
      - [ ] 2019-03-10 - 34 - Vectors
      - [ ] 2019-03-11 - 35 - Plane
      - [ ] 2019-03-12 - 36 - Straight Line
    - [ ] Module - X: Linear Programming and Mathematical Reasoning [0/2]
      - [ ] 2019-03-15 - 37 - Linear Programming
      - [ ] 2019-03-16 - 38 - Mathematical Reasoning
** sandeepk
*** DONE [[https://www.coursera.org/learn/learning-how-to-learn/][Learning How to Learn]] - Part I [1/2]
    CLOSED: [2019-02-05 Tue 23:30]
    :PROPERTIES:
    :ESTIMATED: 9
    :ACTUAL:   4.58
    :OWNER:    sandeepk
    :ID:       READ.1548088815
    :TASKID:   READ.1548088815
    :END:
    :LOGBOOK:
    CLOCK: [2019-01-31 Thu 20:15]--[2019-01-31 Thu 21:35] =>  1:20
    CLOCK: [2019-01-29 Tue 20:55]--[2019-01-29 Tue 22:00] =>  1:05
    CLOCK: [2019-01-28 Mon 21:20]--[2019-01-28 Mon 22:25] =>  1:05
    CLOCK: [2019-01-26 Sat 13:55]--[2019-01-26 Sat 14:30] =>  0:35
    CLOCK: [2019-01-26 Sat 13:00]--[2019-01-26 Sat 13:30] =>  0:30
    :END:
    - [X] Procrastination and Memory (5h)
*** DONE Project Hacker News [3/3]
    :PROPERTIES:
    :ESTIMATED: 15
    :ACTUAL:   10.00
    :OWNER:    sandeepk
    :ID:       DEV.1548171355
    :TASKID:   DEV.1548171355
    :END:
    :LOGBOOK:
    CLOCK: [2019-02-05 Tue 20:20]--[2019-02-05 Tue 21:15] =>  0:55
    CLOCK: [2019-02-04 Mon 20:30]--[2019-02-04 Mon 21:15] =>  0:45
    CLOCK: [2019-02-03 Sun 16:00]--[2019-02-03 Sun 17:00] =>  1:00
    CLOCK: [2019-02-02 Sat 20:00]--[2019-02-02 Sat 21:00] =>  1:00
    CLOCK: [2019-01-30 Wed 21:00]--[2019-01-30 Wed 22:00] =>  1:00
    CLOCK: [2019-01-30 Wed 14:00]--[2019-01-30 Wed 14:40] =>  0:40
    CLOCK: [2019-01-27 Sun 17:00]--[2019-01-27 Sun 18:00] =>  1:00
    CLOCK: [2019-01-27 Sun 14:00]--[2019-01-27 Sun 14:35] =>  0:35
    CLOCK: [2019-01-26 Sat 21:00]--[2019-01-26 Sat 21:30] =>  0:30
    CLOCK: [2019-01-26 Sat 19:00]--[2019-01-26 Sat 19:40] =>  0:40
    CLOCK: [2019-01-21 Mon 23:00]--[2019-01-22 Tue 00:00] =>  1:00
    CLOCK: [2019-01-21 Mon 21:35]--[2019-01-21 Mon 22:30] =>  0:55
    :END:
    - [X] Features Break Down (3h)
    - [X] Env SetUp (6h)
    - [X] Model Layout (6h)
